app/controllers/oracle_cards_controller.rb

SELECT "oracle_cards".* FROM "oracle_cards" WHERE "oracle_cards"."number" = $1 LIMIT $2  [["number", 5], ["LIMIT", 1]]
---
  def show
    # 選択されたカードの詳細を表示
    @card_number = params[:id].to_i
    @oracle_card = OracleCard.find_by(number: @card_number)